04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/pipeBend/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (particles water);

particles
{
    type            pureIsothermalPhaseModel;

    diameterModel
    {
        type            populationBalance;
        populationBalance agglomerates;
        nGroups         30;
    }

    alphaMax        0.62;
    residualAlpha   1e-8;
}

water
{
    type              pureIsothermalPhaseModel;

    diameterModel     none;

    residualAlpha     1e-8;
}

blending
{
    default
    {
        type            continuous;
        phase water;
    }
}

surfaceTension
{}

agglomerates
{
    continuousPhase water;

    sphericalDiameters
    {
        type            exponential;
        min             1e-6;
        max             250e-6;
    }

    shapeModel      spherical;

    coalescenceModel AdachiStuartFokkink;

    breakupModel
    {
        type            Kusters;
        daughterSizeDistributionModel Laakkonen;
        C4              2;
        B               50e-7;
        dP              250e-9;
        Df              2.4;
    }
}

// ************************************************************************* //
